Tekla.Structures.Internal.Plugins.isAssemblyResolverSet
The is assembly resolver set

Tekla.Structures.Internal.Plugins.StartPlugin(System.String)
Starts the plugin.
param: The parameter.
Returns: result

Tekla.Structures.Internal.Plugins.RunPlugin(System.String)
Runs the plugin.
Param: The parameter.
Returns: result

Tekla.Structures.Internal.Plugins.DefinePluginInput(System.String)
Defines the plugin input.
Param: The parameter.
Returns: result

Tekla.Structures.Internal.Plugins.GetPluginDataFields(System.String,System.Collections.Generic.Dictionary{System.String,System.Reflection.FieldInfo}@)
Retrieves all possible attributes of the given plugin.
PluginName: Name of the plugin.
PluginDataFields: Dictionary of field names and their FieldInfo.
Returns: ok or not

Tekla.Structures.Internal.Plugins.GetExtensionsDirectories
Retrieves the path to the Extensions folder which resides in XSDATADIR\\environmens\\\common folder.
Returns: The complete path or empty string if no extensions path existed.

Tekla.Structures.Internal.Plugins.SetAssemblyResolver
Sets the assembly resolver.

Tekla.Structures.Internal.Plugins.InstantiatePlugin(System.String,System.Object@,Tekla.Technology.Scripting.Invoker@)
Instantiates the plugin.
PluginName: Name of the plugin.
plugin: The plugin.
Invoker: The invoker.
Returns: ok or not

Tekla.Structures.Internal.Plugins.InstantiateAndSetAsCurrentPlugin(System.String)
Instantiates the and set as current plugin.
PluginName: Name of the plugin.
Returns: ok or no